ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5x/serial_api.c
        /* Clear event and disable interrupt for channel. */
        nrf_rtc_event_clear(NRF_RTC2, NRF_RTC_EVENT_COMPARE_0);

        uint32_t mask = nrf_rtc_int_get(NRF_RTC2);
        nrf_rtc_int_enable(NRF_RTC2, mask & ~NRF_RTC_INT_COMPARE0_MASK);

        /* Call timeout handler with instance ID. */
        nordic_nrf5_uart_timeout_handler(0);
    }

    /* Channel 1 */
    if (nrf_rtc_event_pending(NRF_RTC2, NRF_RTC_EVENT_COMPARE_1)) {

        /* Clear event and disable interrupt for channel. */
        nrf_rtc_event_clear(NRF_RTC2, NRF_RTC_EVENT_COMPARE_1);

        uint32_t mask = nrf_rtc_int_get(NRF_RTC2);
        nrf_rtc_int_enable(NRF_RTC2, mask & ~NRF_RTC_INT_COMPARE1_MASK);

        /* Call callback handler with instance ID. */
        nordic_nrf5_uart_callback_handler(0);
    }

#if UART1_ENABLED
    /* Channel 2 */
    if (nrf_rtc_event_pending(NRF_RTC2, NRF_RTC_EVENT_COMPARE_2)) {

        /* Clear event and disable interrupt for channel. */
        nrf_rtc_event_clear(NRF_RTC2, NRF_RTC_EVENT_COMPARE_2);

        uint32_t mask = nrf_rtc_int_get(NRF_RTC2);
        nrf_rtc_int_enable(NRF_RTC2, mask & ~NRF_RTC_INT_COMPARE2_MASK);

        /* Call timeout handler with instance ID. */
        nordic_nrf5_uart_timeout_handler(1);
    }

    /* Channel 3 */
    if (nrf_rtc_event_pending(NRF_RTC2, NRF_RTC_EVENT_COMPARE_3)) {

        /* Clear event and disable interrupt for channel. */
        nrf_rtc_event_clear(NRF_RTC2, NRF_RTC_EVENT_COMPARE_3);

        uint32_t mask = nrf_rtc_int_get(NRF_RTC2);
        nrf_rtc_int_enable(NRF_RTC2, mask & ~NRF_RTC_INT_COMPARE3_MASK);

        /* Call callback handler with instance ID. */
        nordic_nrf5_uart_callback_handler(1);
    }
#endif

}


/***
 *      _    _         _____ _______   ______               _     _    _                 _ _           
 *     | |  | |  /\   |  __ \__   __| |  ____|             | |   | |  | |               | | |          
 *     | |  | | /  \  | |__) | | |    | |____   _____ _ __ | |_  | |__| | __ _ _ __   __| | | ___ _ __ 
 *     | |  | |/ /\ \ |  _  /  | |    |  __\ \ / / _ \ '_ \| __| |  __  |/ _` | '_ \ / _` | |/ _ \ '__|
 *     | |__| / ____ \| | \ \  | |    | |___\ V /  __/ | | | |_  | |  | | (_| | | | | (_| | |  __/ |   
 *      \____/_/    \_\_|  \_\ |_|    |______\_/ \___|_| |_|\__| |_|  |_|\__,_|_| |_|\__,_|_|\___|_|   
 *                                                                                                     
 *                                                                                                     
 */

/**
 * @brief      Event handler for when Rx buffer is full or buffer swap has been 
 *             triggered by idle task.
 *             
 *             Copy data from DMA buffer to FIFO buffer. 
 *             Post callback if not already posted.
 *
 * @param[in]  instance  The instance
 */
static void nordic_nrf5_uart_event_handler_endrx(int instance)
{
    /* Increment idle counter. */
    core_util_atomic_incr_u32(&nordic_nrf5_uart_state[instance].endrx_counter, 1);

    /* Read out active bank flag and swap DMA buffers. */
    uint8_t active_bank = nordic_nrf5_uart_state[instance].active_bank;
    nordic_nrf5_uart_state[instance].active_bank = active_bank ^ 0x01;

    /* Get number of bytes in DMA buffer. */
    uint32_t available = nrf_uarte_rx_amount_get(nordic_nrf5_uart_register[instance]);

    if (available > 0) {

        /* Copy data from DMA buffer to FIFO buffer. */
        for (size_t index = 0; index < available; index++) {

            /* Atomic FIFO can be used safely without disabling interrutps. */
            nrf_atfifo_item_put_t fifo_context;

            /* Get pointer to available space. */
            uint8_t *byte = (uint8_t *) nrf_atfifo_item_alloc(nordic_nrf5_uart_state[instance].fifo, &fifo_context);

            if (byte != NULL) {

                /* Copy 1 byte from DMA buffer and commit to FIFO buffer. */
                *byte = nordic_nrf5_uart_state[instance].buffer[active_bank][index];
                nrf_atfifo_item_put(nordic_nrf5_uart_state[instance].fifo, &fifo_context);

            } else {

                /* Buffer overflow. */
                break;
            }
        }

        /* Schedule callback to signal data is available if not already posted. */
        if (nordic_nrf5_uart_state[instance].callback_posted == false) {

            nordic_nrf5_uart_state[instance].callback_posted = true;
            nordic_custom_ticker_set_callback(instance);
        }
    }    
}

/**
 * @brief      Event handler for when DMA has been armed with Rx buffer.
 * 
 *             Arm Rx buffer with second buffer for optimal reception. 
 *
 * @param[in]  instance  The instance
 */
static void nordic_nrf5_uart_event_handler_rxstarted(int instance)
{
    uint8_t next_bank = nordic_nrf5_uart_state[instance].active_bank ^ 0x01;

    nrf_uarte_rx_buffer_set(nordic_nrf5_uart_register[instance], nordic_nrf5_uart_state[instance].buffer[next_bank], DMA_BUFFER_SIZE);    
}

/**
 * @brief      Event handler for when a character has been received in DMA buffer.
 *
 *             Increment idle counter and set idle timeout if not already set.
 *
 * @param[in]  instance  The instance
 */
static void nordic_nrf5_uart_event_handler_rxdrdy(int instance)
{
    /* Increment idle counter. */
    core_util_atomic_incr_u32(&nordic_nrf5_uart_state[instance].rxdrdy_counter, 1);

    /* Set idle timeout if not already set. */
    if (nordic_nrf5_uart_state[instance].ticker_is_running == false) {

        nordic_nrf5_uart_state[instance].ticker_is_running = true;

        nordic_custom_ticker_set_timeout(instance);
    }    
}

/**
 * @brief      Event handler for when the Tx buffer has been transmitted.
 *
 * @param[in]  instance  The instance
 */
static void nordic_nrf5_uart_event_handler_endtx(int instance)
{
    /* Set Tx done. */
    nordic_nrf5_uart_state[instance].tx_in_progress = 0;

    /* Check if callback handler and Tx event mask is set. */
    uart_irq_handler callback = (uart_irq_handler) nordic_nrf5_uart_state[instance].owner->handler;
    uint32_t mask = nordic_nrf5_uart_state[instance].owner->mask;

    if (callback && (mask & NORDIC_TX_IRQ)) {

        /* Invoke callback function. */
        uint32_t context = nordic_nrf5_uart_state[instance].owner->context;
        callback(context, TxIrq);
    }
}

